## Plan Result (demo-global)




<pre><code>Plan: 16 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int1&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int2&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-srt&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-wa-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int1&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int2&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-srt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-wa-int&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-register-org"
          + load_balancing_name = "loadBalancingSettings-xui-register-org"
          + name                = "xui-register-org"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "register-org.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-approve-org"
          + load_balancing_name = "loadBalancingSettings-xui-approve-org"
          + name                = "xui-approve-org"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "administer-orgs.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-manage-org"
          + load_balancing_name = "loadBalancingSettings-xui-manage-org"
          + name                = "xui-manage-org"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-org.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-webapp-int1"
          + load_balancing_name = "loadBalancingSettings-xui-webapp-int1"
          + name                = "xui-webapp-int1"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-case-int1.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-webapp-int2"
          + load_balancing_name = "loadBalancingSettings-xui-webapp-int2"
          + name                = "xui-webapp-int2"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-case-int2.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-webapp"
          + load_balancing_name = "loadBalancingSettings-xui-webapp"
          + name                = "xui-webapp"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-case.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-webapp-srt"
          + load_balancing_name = "loadBalancingSettings-xui-webapp-srt"
          + name                = "xui-webapp-srt"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-case-srt.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-xui-webapp-wa-int"
          + load_balancing_name = "loadBalancingSettings-xui-webapp-wa-int"
          + name                = "xui-webapp-wa-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "manage-case-wa-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-register-org"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-approve-org"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-manage-org"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-webapp-int1"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-webapp-int2"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-webapp"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-webapp-srt"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-xui-webapp-wa-int"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-register-org"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-approve-org"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-manage-org"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-webapp-int1"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-webapp-int2"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-webapp"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-webapp-srt"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-xui-webapp-wa-int"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web.demo.platform.hmcts.net" -> "register-org.demo.platform.hmcts.net"
            id                                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web"
          ~ name                                    = "wwwpaymentoutcome-web" -> "xui-register-org"
          + web_application_firewall_policy_link_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "www.paymentoutcome-web-int.demo.platform.hmcts.net" -> "administer-orgs.demo.platform.hmcts.net"
            id                                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/wwwpaymentoutcome-web-int"
          ~ name                                    = "wwwpaymentoutcome-web-int" -> "xui-approve-org"
          + web_application_firewall_policy_link_id = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                               = "manage-org.demo.platform.hmcts.net"
          + name                                    = "xui-manage-org"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "manage-case-int1.demo.platform.hmcts.net"
          + name                                    = "xui-webapp-int1"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "manage-case-int2.demo.platform.hmcts.net"
          + name                                    = "xui-webapp-int2"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "manage-case.demo.platform.hmcts.net"
          + name                                    = "xui-webapp"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "manage-case-srt.demo.platform.hmcts.net"
          + name                                    = "xui-webapp-srt"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "manage-case-wa-int.demo.platform.hmcts.net"
          + name                                    = "xui-webapp-wa-int"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web.demo.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web-int.demo.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web-int"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "reformscan",
              + "xui-register-org",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "xui-register-org"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "xui-register-org"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "xui-approve-org",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "xui-approve-org"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "xui-approve-org"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "plum-public",
              + "xui-manage-org",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/plum-publicHttpsRedirect"
          ~ name               = "plum-publicHttpsRedirect" -> "xui-manage-org"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "xui-manage-org"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "plum",
              + "xui-webapp-int1",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "xui-webapp-int1"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "xui-webapp-int1"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "dss-update-case",
              + "xui-webapp-int2",
  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

          + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-webapp-hearings-int",
            ]
          + name               = "xui-webapp-hearings-intHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-register-org",
            ]
          + name               = "xui-register-orgHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-approve-org",
            ]
          + name               = "xui-approve-orgHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-manage-org",
            ]
          + name               = "xui-manage-orgHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-webapp-int1",
            ]
          + name               = "xui-webapp-int1HttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-webapp-int2",
            ]
          + name               = "xui-webapp-int2HttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-webapp",
            ]
          + name               = "xui-webappHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-webapp-srt",
            ]
          + name               = "xui-webapp-srtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "xui-webapp-wa-int",
            ]
          + name               = "xui-webapp-wa-intHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.demo.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web-int",
            ]
          + name               = "paymentoutcome-web-intwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web-int.demo.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (267 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-approve-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-manage-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-register-org"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-register-org"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp-int1"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp-int1"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp-int2"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp-int2"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp-srt"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp-srt"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["xui-webapp-wa-int"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/xui-webapp-wa-int"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiapproveorgdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuimanageorgdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-register-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiregisterorgdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-int1"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappint1demo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-int2"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappint2demo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-srt"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappsrtdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-wa-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappwaintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 16 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["gateway-ccd"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/gateway-ccd",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/gatewayccddemo"
        name                              = "gatewayccddemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["gateway-ccd-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/gateway-ccd-int",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/gatewayccdintdemo"
        name                              = "gatewayccdintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["return-case-doc-ccd"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/return-case-doc-ccd",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/returncasedocccddemo"
        name                              = "returncasedocccddemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["return-case-doc-ccd-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/return-case-doc-ccd-int",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/returncasedocccdintdemo"
        name                              = "returncasedocccdintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-ac-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/xui-webapp-ac-int",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiwebappacintdemo"
        name                              = "xuiwebappacintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-caa-ac"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/xui-webapp-caa-ac",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiwebappcaaacdemo"
        name                              = "xuiwebappcaaacdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-hearings-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/xui-webapp-hearings-int",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiwebapphearingsintdemo"
        name                              = "xuiwebapphearingsintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["xui-webapp-int"] has changed
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
      ~ frontend_endpoint_ids             = [
          + "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourcegroups/lz-demo-rg/providers/Microsoft.Network/frontdoors/hmcts-demo/frontendendpoints/xui-webapp-int",
        ]
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/xuiwebappintdemo"
        name                              = "xuiwebappintdemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1505,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->